CSI API ETABS v1
cGroup.Delete Method
 Deletes the specified group.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int Delete(
	string Name
)
Function Delete (
	Name As String
) As Integer
Dim instance As cGroup
Dim Name As String
Dim returnValue As Integer
returnValue = instance.Delete(Name)
int Delete(
	String^ Name
)
abstract Delete :
        Name : string -> int
Parameters
Name
Type: System.String
 The name of an existing group.
Return Value
Type: Int32
 Returns zero if the group is successfully deleted, otherwise it returns a nonzero value.
Remarks
 An error will be returned if an attempt is made to delete the Group named "ALL".
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
    'define new group
       ret = SapModel.GroupDef.SetGroup("Group1")
    'delete group
       ret = SapModel.GroupDef.Delete("Group1")
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cGroup Interface
ETABSv1 Namespace